# 3.2c Appending *pandas* Dataframes  

1. [Get the Data into Dataframes](#1.-Get-the-Data-into-Dataframes)
2. [Append the Dataframes](#2.-Append-the-Dataframes)   


3. [Save the Appended Dataframe as a Pickle File](#3.-Save-the-Appended-Dataframe-as-a-Pickle-File)

In [58]:
#Import pandas 
import pandas as pd

# 1. Get the Data into Dataframes

###  *mnth7_2011.csv*  

- Filename:  mnth7_2011.csv
- Number of Rows:   10
- Number of Columns:   6

In [59]:
#Read the csv file into a pandas dataframe
#Note: This file is in the Data folder underneath this folder 
df_mnth7_2011 = pd.read_csv('Data//mnth7_2011.csv')

In [60]:
print("Filename:  mnth7_2011.csv")
print("Number of Rows:  ", df_mnth7_2011.shape[0])
print("Number of Columns:  ", df_mnth7_2011.shape[1])

Filename:  mnth7_2011.csv
Number of Rows:   10
Number of Columns:   6

In [61]:
#Display the first three records/rows in the dataframe
df_mnth7_2011.head(3)

     Order_ID  Order_Type  Employee_ID  Customer_ID Order_Date Delivery_Date
0  1242691897           2     99999999           90  02JUL2011     04JUL2011
1  1242736731           1       121107           10  07JUL2011     07JUL2011
2  1242773202           3     99999999           24  11JUL2011     14JUL2011

###  *mnth8_2011.csv*  


- Filename:  mnth8_2011.csv
- Number of Rows:   12
- Number of Columns:   6

In [62]:
# mnth8_2011.csv

#Read the csv file into a pandas dataframe
#Note: This file is in the Data folder underneath this folder 
df_mnth8_2011 = pd.read_csv('Data//mnth8_2011.csv')

In [63]:
print("Filename:  mnth8_2011.csv")
print("Number of Rows:  ", df_mnth8_2011.shape[0])
print("Number of Columns:  ", df_mnth8_2011.shape[1])

Filename:  mnth8_2011.csv
Number of Rows:   12
Number of Columns:   6

In [64]:
#Display the first two rows in the dataframe
df_mnth8_2011.head(2)

     Order_ID  Order_Type  Employee_ID  Customer_ID Order_Date Delivery_Date
0  1242977743           2     99999999           65  03AUG2011     07AUG2011
1  1243012144           2     99999999         2806  06AUG2011     10AUG2011

## Display top two rows of the two dataframes we will append

In [65]:
# Display the first two rows of the first dataframe to append
df_mnth7_2011.head(2)

     Order_ID  Order_Type  Employee_ID  Customer_ID Order_Date Delivery_Date
0  1242691897           2     99999999           90  02JUL2011     04JUL2011
1  1242736731           1       121107           10  07JUL2011     07JUL2011

In [66]:
# Display the first two rows of the second dataframe to append
df_mnth8_2011.head(2)

     Order_ID  Order_Type  Employee_ID  Customer_ID Order_Date Delivery_Date
0  1242977743           2     99999999           65  03AUG2011     07AUG2011
1  1243012144           2     99999999         2806  06AUG2011     10AUG2011

# 2. Append the Dataframes

### Append df_mnth8_2011 to df_mnth7_2011  
After appending should end up with:  
- Number of Rows:   10 + 12 = 22  
- Number of Columns:   6

In [73]:
# Append df_mnth8_2011 to df_mnth7_2011
df_Appended_8_2011 = df_mnth7_2011.append(df_mnth8_2011, ignore_index=True)

In [74]:
# Append check for df_Appended_8_2011
print("Dataframe:  df_Appended_8_2011")
print("Number of Rows:  ", df_Appended_8_2011.shape[0])
print("Number of Columns:  ", df_Appended_8_2011.shape[1])

Dataframe:  df_Appended_8_2011
Number of Rows:   22
Number of Columns:   6

In [75]:
df_Appended_8_2011.head()

     Order_ID  Order_Type  Employee_ID  Customer_ID Order_Date Delivery_Date
0  1242691897           2     99999999           90  02JUL2011     04JUL2011
1  1242736731           1       121107           10  07JUL2011     07JUL2011
2  1242773202           3     99999999           24  11JUL2011     14JUL2011
3  1242782701           3     99999999           27  12JUL2011     17JUL2011
4  1242827683           1       121105           10  17JUL2011     17JUL2011

# 3. Save the Appended Dataframe as a Pickle File

In [78]:
# Save the Appended Dataframe as a Pickle file
import pickle

# Save the df dataframe as a pickle file in the Data folder
df_Appended_8_2011.to_pickle('./Data/df_Appended_8_2011.pkl')

In [79]:
# Check that the pickle files has the correct number of rows and columns

# Read (unpickle) the saved pickle data frame 
df_pickle_test = pd.read_pickle('Appended_8_2011.pkl')

# Append check pickle file
print("Dataframe:  df_pickle_test")
print("Number of Rows:  ", df_pickle_test.shape[0])
print("Number of Columns:  ", df_pickle_test.shape[1])

Dataframe:  df_pickle_test
Number of Rows:   22
Number of Columns:   6